analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/pwrseq_regs.h
#define MXC_F_PWRSEQ_LPMEMSD_ICCXIP_POS                8 /**< LPMEMSD_ICCXIP Position */
#define MXC_F_PWRSEQ_LPMEMSD_ICCXIP                    ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPMEMSD_ICCXIP_POS)) /**< LPMEMSD_ICCXIP Mask */

#define MXC_F_PWRSEQ_LPMEMSD_SRCC_POS                  9 /**< LPMEMSD_SRCC Position */
#define MXC_F_PWRSEQ_LPMEMSD_SRCC                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPMEMSD_SRCC_POS)) /**< LPMEMSD_SRCC Mask */

#define MXC_F_PWRSEQ_LPMEMSD_CRYPTO_POS                10 /**< LPMEMSD_CRYPTO Position */
#define MXC_F_PWRSEQ_LPMEMSD_CRYPTO                    ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPMEMSD_CRYPTO_POS)) /**< LPMEMSD_CRYPTO Mask */

#define MXC_F_PWRSEQ_LPMEMSD_USBFIFO_POS               11 /**< LPMEMSD_USBFIFO Position */
#define MXC_F_PWRSEQ_LPMEMSD_USBFIFO                   ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPMEMSD_USBFIFO_POS)) /**< LPMEMSD_USBFIFO Mask */

#define MXC_F_PWRSEQ_LPMEMSD_ROM0_POS                  12 /**< LPMEMSD_ROM0 Position */
#define MXC_F_PWRSEQ_LPMEMSD_ROM0                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPMEMSD_ROM0_POS)) /**< LPMEMSD_ROM0 Mask */

#define MXC_F_PWRSEQ_LPMEMSD_MEU_POS                   13 /**< LPMEMSD_MEU Position */
#define MXC_F_PWRSEQ_LPMEMSD_MEU                       ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPMEMSD_MEU_POS)) /**< LPMEMSD_MEU Mask */

#define MXC_F_PWRSEQ_LPMEMSD_ROM1_POS                  15 /**< LPMEMSD_ROM1 Position */
#define MXC_F_PWRSEQ_LPMEMSD_ROM1                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_LPMEMSD_ROM1_POS)) /**< LPMEMSD_ROM1 Mask */

/**@} end of group PWRSEQ_LPMEMSD_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_LPWKPOL0A PWRSEQ_LPWKPOL0A
 * @brief    Low Power Wakeup Polarity Select for GPIO0.
 * @{
 */
#define MXC_F_PWRSEQ_LPWKPOL0A_0_POS                   0 /**< LPWKPOL0A_0 Position */
#define MXC_F_PWRSEQ_LPWKPOL0A_0                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL0A_0_POS)) /**< LPWKPOL0A_0 Mask */
#define MXC_V_PWRSEQ_LPWKPOL0A_0_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL0A_0_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_0_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL0A_0_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL0A_0_POS) /**< LPWKPOL0A_0_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_0_RISING                ((uint32_t)0x1UL) /**< LPWKPOL0A_0_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_0_RISING                (MXC_V_PWRSEQ_LPWKPOL0A_0_RISING << MXC_F_PWRSEQ_LPWKPOL0A_0_POS) /**< LPWKPOL0A_0_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_0_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL0A_0_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_0_FALLING               (MXC_V_PWRSEQ_LPWKPOL0A_0_FALLING << MXC_F_PWRSEQ_LPWKPOL0A_0_POS) /**< LPWKPOL0A_0_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL0A_1_POS                   2 /**< LPWKPOL0A_1 Position */
#define MXC_F_PWRSEQ_LPWKPOL0A_1                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL0A_1_POS)) /**< LPWKPOL0A_1 Mask */
#define MXC_V_PWRSEQ_LPWKPOL0A_1_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL0A_1_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_1_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL0A_1_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL0A_1_POS) /**< LPWKPOL0A_1_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_1_RISING                ((uint32_t)0x1UL) /**< LPWKPOL0A_1_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_1_RISING                (MXC_V_PWRSEQ_LPWKPOL0A_1_RISING << MXC_F_PWRSEQ_LPWKPOL0A_1_POS) /**< LPWKPOL0A_1_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_1_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL0A_1_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_1_FALLING               (MXC_V_PWRSEQ_LPWKPOL0A_1_FALLING << MXC_F_PWRSEQ_LPWKPOL0A_1_POS) /**< LPWKPOL0A_1_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL0A_2_POS                   4 /**< LPWKPOL0A_2 Position */
#define MXC_F_PWRSEQ_LPWKPOL0A_2                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL0A_2_POS)) /**< LPWKPOL0A_2 Mask */
#define MXC_V_PWRSEQ_LPWKPOL0A_2_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL0A_2_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_2_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL0A_2_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL0A_2_POS) /**< LPWKPOL0A_2_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_2_RISING                ((uint32_t)0x1UL) /**< LPWKPOL0A_2_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_2_RISING                (MXC_V_PWRSEQ_LPWKPOL0A_2_RISING << MXC_F_PWRSEQ_LPWKPOL0A_2_POS) /**< LPWKPOL0A_2_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_2_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL0A_2_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_2_FALLING               (MXC_V_PWRSEQ_LPWKPOL0A_2_FALLING << MXC_F_PWRSEQ_LPWKPOL0A_2_POS) /**< LPWKPOL0A_2_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL0A_3_POS                   6 /**< LPWKPOL0A_3 Position */
#define MXC_F_PWRSEQ_LPWKPOL0A_3                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL0A_3_POS)) /**< LPWKPOL0A_3 Mask */
#define MXC_V_PWRSEQ_LPWKPOL0A_3_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL0A_3_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_3_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL0A_3_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL0A_3_POS) /**< LPWKPOL0A_3_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_3_RISING                ((uint32_t)0x1UL) /**< LPWKPOL0A_3_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_3_RISING                (MXC_V_PWRSEQ_LPWKPOL0A_3_RISING << MXC_F_PWRSEQ_LPWKPOL0A_3_POS) /**< LPWKPOL0A_3_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_3_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL0A_3_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_3_FALLING               (MXC_V_PWRSEQ_LPWKPOL0A_3_FALLING << MXC_F_PWRSEQ_LPWKPOL0A_3_POS) /**< LPWKPOL0A_3_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL0A_4_POS                   8 /**< LPWKPOL0A_4 Position */
#define MXC_F_PWRSEQ_LPWKPOL0A_4                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL0A_4_POS)) /**< LPWKPOL0A_4 Mask */
#define MXC_V_PWRSEQ_LPWKPOL0A_4_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL0A_4_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_4_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL0A_4_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL0A_4_POS) /**< LPWKPOL0A_4_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_4_RISING                ((uint32_t)0x1UL) /**< LPWKPOL0A_4_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_4_RISING                (MXC_V_PWRSEQ_LPWKPOL0A_4_RISING << MXC_F_PWRSEQ_LPWKPOL0A_4_POS) /**< LPWKPOL0A_4_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_4_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL0A_4_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_4_FALLING               (MXC_V_PWRSEQ_LPWKPOL0A_4_FALLING << MXC_F_PWRSEQ_LPWKPOL0A_4_POS) /**< LPWKPOL0A_4_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL0A_5_POS                   10 /**< LPWKPOL0A_5 Position */
#define MXC_F_PWRSEQ_LPWKPOL0A_5                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL0A_5_POS)) /**< LPWKPOL0A_5 Mask */
#define MXC_V_PWRSEQ_LPWKPOL0A_5_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL0A_5_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_5_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL0A_5_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL0A_5_POS) /**< LPWKPOL0A_5_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_5_RISING                ((uint32_t)0x1UL) /**< LPWKPOL0A_5_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_5_RISING                (MXC_V_PWRSEQ_LPWKPOL0A_5_RISING << MXC_F_PWRSEQ_LPWKPOL0A_5_POS) /**< LPWKPOL0A_5_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_5_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL0A_5_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_5_FALLING               (MXC_V_PWRSEQ_LPWKPOL0A_5_FALLING << MXC_F_PWRSEQ_LPWKPOL0A_5_POS) /**< LPWKPOL0A_5_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL0A_6_POS                   12 /**< LPWKPOL0A_6 Position */
#define MXC_F_PWRSEQ_LPWKPOL0A_6                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL0A_6_POS)) /**< LPWKPOL0A_6 Mask */
#define MXC_V_PWRSEQ_LPWKPOL0A_6_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL0A_6_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_6_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL0A_6_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL0A_6_POS) /**< LPWKPOL0A_6_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_6_RISING                ((uint32_t)0x1UL) /**< LPWKPOL0A_6_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_6_RISING                (MXC_V_PWRSEQ_LPWKPOL0A_6_RISING << MXC_F_PWRSEQ_LPWKPOL0A_6_POS) /**< LPWKPOL0A_6_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL0A_6_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL0A_6_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL0A_6_FALLING               (MXC_V_PWRSEQ_LPWKPOL0A_6_FALLING << MXC_F_PWRSEQ_LPWKPOL0A_6_POS) /**< LPWKPOL0A_6_FALLING Setting */

