analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/pwrseq_regs.h
#define MXC_F_PWRSEQ_LPWKPOL1A_10_POS                  20 /**< LPWKPOL1A_10 Position */
#define MXC_F_PWRSEQ_LPWKPOL1A_10                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1A_10_POS)) /**< LPWKPOL1A_10 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1A_10_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1A_10_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_10_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1A_10_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1A_10_POS) /**< LPWKPOL1A_10_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_10_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1A_10_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_10_RISING               (MXC_V_PWRSEQ_LPWKPOL1A_10_RISING << MXC_F_PWRSEQ_LPWKPOL1A_10_POS) /**< LPWKPOL1A_10_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_10_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1A_10_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_10_FALLING              (MXC_V_PWRSEQ_LPWKPOL1A_10_FALLING << MXC_F_PWRSEQ_LPWKPOL1A_10_POS) /**< LPWKPOL1A_10_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1A_11_POS                  22 /**< LPWKPOL1A_11 Position */
#define MXC_F_PWRSEQ_LPWKPOL1A_11                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1A_11_POS)) /**< LPWKPOL1A_11 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1A_11_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1A_11_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_11_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1A_11_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1A_11_POS) /**< LPWKPOL1A_11_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_11_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1A_11_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_11_RISING               (MXC_V_PWRSEQ_LPWKPOL1A_11_RISING << MXC_F_PWRSEQ_LPWKPOL1A_11_POS) /**< LPWKPOL1A_11_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_11_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1A_11_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_11_FALLING              (MXC_V_PWRSEQ_LPWKPOL1A_11_FALLING << MXC_F_PWRSEQ_LPWKPOL1A_11_POS) /**< LPWKPOL1A_11_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1A_12_POS                  24 /**< LPWKPOL1A_12 Position */
#define MXC_F_PWRSEQ_LPWKPOL1A_12                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1A_12_POS)) /**< LPWKPOL1A_12 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1A_12_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1A_12_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_12_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1A_12_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1A_12_POS) /**< LPWKPOL1A_12_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_12_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1A_12_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_12_RISING               (MXC_V_PWRSEQ_LPWKPOL1A_12_RISING << MXC_F_PWRSEQ_LPWKPOL1A_12_POS) /**< LPWKPOL1A_12_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_12_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1A_12_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_12_FALLING              (MXC_V_PWRSEQ_LPWKPOL1A_12_FALLING << MXC_F_PWRSEQ_LPWKPOL1A_12_POS) /**< LPWKPOL1A_12_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1A_13_POS                  26 /**< LPWKPOL1A_13 Position */
#define MXC_F_PWRSEQ_LPWKPOL1A_13                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1A_13_POS)) /**< LPWKPOL1A_13 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1A_13_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1A_13_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_13_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1A_13_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1A_13_POS) /**< LPWKPOL1A_13_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_13_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1A_13_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_13_RISING               (MXC_V_PWRSEQ_LPWKPOL1A_13_RISING << MXC_F_PWRSEQ_LPWKPOL1A_13_POS) /**< LPWKPOL1A_13_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_13_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1A_13_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_13_FALLING              (MXC_V_PWRSEQ_LPWKPOL1A_13_FALLING << MXC_F_PWRSEQ_LPWKPOL1A_13_POS) /**< LPWKPOL1A_13_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1A_14_POS                  28 /**< LPWKPOL1A_14 Position */
#define MXC_F_PWRSEQ_LPWKPOL1A_14                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1A_14_POS)) /**< LPWKPOL1A_14 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1A_14_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1A_14_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_14_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1A_14_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1A_14_POS) /**< LPWKPOL1A_14_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_14_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1A_14_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_14_RISING               (MXC_V_PWRSEQ_LPWKPOL1A_14_RISING << MXC_F_PWRSEQ_LPWKPOL1A_14_POS) /**< LPWKPOL1A_14_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_14_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1A_14_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_14_FALLING              (MXC_V_PWRSEQ_LPWKPOL1A_14_FALLING << MXC_F_PWRSEQ_LPWKPOL1A_14_POS) /**< LPWKPOL1A_14_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1A_15_POS                  30 /**< LPWKPOL1A_15 Position */
#define MXC_F_PWRSEQ_LPWKPOL1A_15                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1A_15_POS)) /**< LPWKPOL1A_15 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1A_15_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1A_15_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_15_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1A_15_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1A_15_POS) /**< LPWKPOL1A_15_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_15_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1A_15_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_15_RISING               (MXC_V_PWRSEQ_LPWKPOL1A_15_RISING << MXC_F_PWRSEQ_LPWKPOL1A_15_POS) /**< LPWKPOL1A_15_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1A_15_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1A_15_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1A_15_FALLING              (MXC_V_PWRSEQ_LPWKPOL1A_15_FALLING << MXC_F_PWRSEQ_LPWKPOL1A_15_POS) /**< LPWKPOL1A_15_FALLING Setting */

