analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/pwrseq_regs.h
#define MXC_F_PWRSEQ_LPWKPOL1B_23_POS                  14 /**< LPWKPOL1B_23 Position */
#define MXC_F_PWRSEQ_LPWKPOL1B_23                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1B_23_POS)) /**< LPWKPOL1B_23 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1B_23_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1B_23_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_23_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1B_23_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1B_23_POS) /**< LPWKPOL1B_23_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_23_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1B_23_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_23_RISING               (MXC_V_PWRSEQ_LPWKPOL1B_23_RISING << MXC_F_PWRSEQ_LPWKPOL1B_23_POS) /**< LPWKPOL1B_23_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_23_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1B_23_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_23_FALLING              (MXC_V_PWRSEQ_LPWKPOL1B_23_FALLING << MXC_F_PWRSEQ_LPWKPOL1B_23_POS) /**< LPWKPOL1B_23_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1B_24_POS                  16 /**< LPWKPOL1B_24 Position */
#define MXC_F_PWRSEQ_LPWKPOL1B_24                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1B_24_POS)) /**< LPWKPOL1B_24 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1B_24_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1B_24_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_24_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1B_24_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1B_24_POS) /**< LPWKPOL1B_24_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_24_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1B_24_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_24_RISING               (MXC_V_PWRSEQ_LPWKPOL1B_24_RISING << MXC_F_PWRSEQ_LPWKPOL1B_24_POS) /**< LPWKPOL1B_24_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_24_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1B_24_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_24_FALLING              (MXC_V_PWRSEQ_LPWKPOL1B_24_FALLING << MXC_F_PWRSEQ_LPWKPOL1B_24_POS) /**< LPWKPOL1B_24_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1B_25_POS                  18 /**< LPWKPOL1B_25 Position */
#define MXC_F_PWRSEQ_LPWKPOL1B_25                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1B_25_POS)) /**< LPWKPOL1B_25 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1B_25_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1B_25_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_25_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1B_25_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1B_25_POS) /**< LPWKPOL1B_25_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_25_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1B_25_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_25_RISING               (MXC_V_PWRSEQ_LPWKPOL1B_25_RISING << MXC_F_PWRSEQ_LPWKPOL1B_25_POS) /**< LPWKPOL1B_25_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_25_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1B_25_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_25_FALLING              (MXC_V_PWRSEQ_LPWKPOL1B_25_FALLING << MXC_F_PWRSEQ_LPWKPOL1B_25_POS) /**< LPWKPOL1B_25_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1B_26_POS                  20 /**< LPWKPOL1B_26 Position */
#define MXC_F_PWRSEQ_LPWKPOL1B_26                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1B_26_POS)) /**< LPWKPOL1B_26 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1B_26_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1B_26_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_26_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1B_26_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1B_26_POS) /**< LPWKPOL1B_26_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_26_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1B_26_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_26_RISING               (MXC_V_PWRSEQ_LPWKPOL1B_26_RISING << MXC_F_PWRSEQ_LPWKPOL1B_26_POS) /**< LPWKPOL1B_26_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_26_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1B_26_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_26_FALLING              (MXC_V_PWRSEQ_LPWKPOL1B_26_FALLING << MXC_F_PWRSEQ_LPWKPOL1B_26_POS) /**< LPWKPOL1B_26_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1B_27_POS                  22 /**< LPWKPOL1B_27 Position */
#define MXC_F_PWRSEQ_LPWKPOL1B_27                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1B_27_POS)) /**< LPWKPOL1B_27 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1B_27_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1B_27_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_27_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1B_27_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1B_27_POS) /**< LPWKPOL1B_27_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_27_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1B_27_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_27_RISING               (MXC_V_PWRSEQ_LPWKPOL1B_27_RISING << MXC_F_PWRSEQ_LPWKPOL1B_27_POS) /**< LPWKPOL1B_27_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_27_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1B_27_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_27_FALLING              (MXC_V_PWRSEQ_LPWKPOL1B_27_FALLING << MXC_F_PWRSEQ_LPWKPOL1B_27_POS) /**< LPWKPOL1B_27_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1B_28_POS                  24 /**< LPWKPOL1B_28 Position */
#define MXC_F_PWRSEQ_LPWKPOL1B_28                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1B_28_POS)) /**< LPWKPOL1B_28 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1B_28_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1B_28_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_28_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1B_28_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1B_28_POS) /**< LPWKPOL1B_28_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_28_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1B_28_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_28_RISING               (MXC_V_PWRSEQ_LPWKPOL1B_28_RISING << MXC_F_PWRSEQ_LPWKPOL1B_28_POS) /**< LPWKPOL1B_28_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_28_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1B_28_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_28_FALLING              (MXC_V_PWRSEQ_LPWKPOL1B_28_FALLING << MXC_F_PWRSEQ_LPWKPOL1B_28_POS) /**< LPWKPOL1B_28_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1B_29_POS                  26 /**< LPWKPOL1B_29 Position */
#define MXC_F_PWRSEQ_LPWKPOL1B_29                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1B_29_POS)) /**< LPWKPOL1B_29 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1B_29_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1B_29_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_29_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1B_29_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1B_29_POS) /**< LPWKPOL1B_29_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_29_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1B_29_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_29_RISING               (MXC_V_PWRSEQ_LPWKPOL1B_29_RISING << MXC_F_PWRSEQ_LPWKPOL1B_29_POS) /**< LPWKPOL1B_29_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_29_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1B_29_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_29_FALLING              (MXC_V_PWRSEQ_LPWKPOL1B_29_FALLING << MXC_F_PWRSEQ_LPWKPOL1B_29_POS) /**< LPWKPOL1B_29_FALLING Setting */

