analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/pwrseq_regs.h
#define MXC_F_PWRSEQ_LPWKPOL1B_30_POS                  28 /**< LPWKPOL1B_30 Position */
#define MXC_F_PWRSEQ_LPWKPOL1B_30                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1B_30_POS)) /**< LPWKPOL1B_30 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1B_30_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1B_30_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_30_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1B_30_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1B_30_POS) /**< LPWKPOL1B_30_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_30_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1B_30_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_30_RISING               (MXC_V_PWRSEQ_LPWKPOL1B_30_RISING << MXC_F_PWRSEQ_LPWKPOL1B_30_POS) /**< LPWKPOL1B_30_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_30_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1B_30_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_30_FALLING              (MXC_V_PWRSEQ_LPWKPOL1B_30_FALLING << MXC_F_PWRSEQ_LPWKPOL1B_30_POS) /**< LPWKPOL1B_30_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL1B_31_POS                  30 /**< LPWKPOL1B_31 Position */
#define MXC_F_PWRSEQ_LPWKPOL1B_31                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL1B_31_POS)) /**< LPWKPOL1B_31 Mask */
#define MXC_V_PWRSEQ_LPWKPOL1B_31_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL1B_31_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_31_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL1B_31_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL1B_31_POS) /**< LPWKPOL1B_31_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_31_RISING               ((uint32_t)0x1UL) /**< LPWKPOL1B_31_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_31_RISING               (MXC_V_PWRSEQ_LPWKPOL1B_31_RISING << MXC_F_PWRSEQ_LPWKPOL1B_31_POS) /**< LPWKPOL1B_31_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL1B_31_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL1B_31_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL1B_31_FALLING              (MXC_V_PWRSEQ_LPWKPOL1B_31_FALLING << MXC_F_PWRSEQ_LPWKPOL1B_31_POS) /**< LPWKPOL1B_31_FALLING Setting */

/**@} end of group PWRSEQ_LPWKPOL1B_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_LPWKPOL2A PWRSEQ_LPWKPOL2A
 * @brief    Low Power Wakeup Polarity Select for GPIO2.
 * @{
 */
#define MXC_F_PWRSEQ_LPWKPOL2A_0_POS                   0 /**< LPWKPOL2A_0 Position */
#define MXC_F_PWRSEQ_LPWKPOL2A_0                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2A_0_POS)) /**< LPWKPOL2A_0 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2A_0_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL2A_0_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_0_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL2A_0_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2A_0_POS) /**< LPWKPOL2A_0_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_0_RISING                ((uint32_t)0x1UL) /**< LPWKPOL2A_0_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_0_RISING                (MXC_V_PWRSEQ_LPWKPOL2A_0_RISING << MXC_F_PWRSEQ_LPWKPOL2A_0_POS) /**< LPWKPOL2A_0_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_0_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL2A_0_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_0_FALLING               (MXC_V_PWRSEQ_LPWKPOL2A_0_FALLING << MXC_F_PWRSEQ_LPWKPOL2A_0_POS) /**< LPWKPOL2A_0_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2A_1_POS                   2 /**< LPWKPOL2A_1 Position */
#define MXC_F_PWRSEQ_LPWKPOL2A_1                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2A_1_POS)) /**< LPWKPOL2A_1 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2A_1_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL2A_1_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_1_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL2A_1_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2A_1_POS) /**< LPWKPOL2A_1_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_1_RISING                ((uint32_t)0x1UL) /**< LPWKPOL2A_1_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_1_RISING                (MXC_V_PWRSEQ_LPWKPOL2A_1_RISING << MXC_F_PWRSEQ_LPWKPOL2A_1_POS) /**< LPWKPOL2A_1_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_1_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL2A_1_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_1_FALLING               (MXC_V_PWRSEQ_LPWKPOL2A_1_FALLING << MXC_F_PWRSEQ_LPWKPOL2A_1_POS) /**< LPWKPOL2A_1_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2A_2_POS                   4 /**< LPWKPOL2A_2 Position */
#define MXC_F_PWRSEQ_LPWKPOL2A_2                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2A_2_POS)) /**< LPWKPOL2A_2 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2A_2_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL2A_2_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_2_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL2A_2_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2A_2_POS) /**< LPWKPOL2A_2_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_2_RISING                ((uint32_t)0x1UL) /**< LPWKPOL2A_2_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_2_RISING                (MXC_V_PWRSEQ_LPWKPOL2A_2_RISING << MXC_F_PWRSEQ_LPWKPOL2A_2_POS) /**< LPWKPOL2A_2_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_2_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL2A_2_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_2_FALLING               (MXC_V_PWRSEQ_LPWKPOL2A_2_FALLING << MXC_F_PWRSEQ_LPWKPOL2A_2_POS) /**< LPWKPOL2A_2_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2A_3_POS                   6 /**< LPWKPOL2A_3 Position */
#define MXC_F_PWRSEQ_LPWKPOL2A_3                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2A_3_POS)) /**< LPWKPOL2A_3 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2A_3_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL2A_3_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_3_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL2A_3_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2A_3_POS) /**< LPWKPOL2A_3_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_3_RISING                ((uint32_t)0x1UL) /**< LPWKPOL2A_3_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_3_RISING                (MXC_V_PWRSEQ_LPWKPOL2A_3_RISING << MXC_F_PWRSEQ_LPWKPOL2A_3_POS) /**< LPWKPOL2A_3_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_3_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL2A_3_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_3_FALLING               (MXC_V_PWRSEQ_LPWKPOL2A_3_FALLING << MXC_F_PWRSEQ_LPWKPOL2A_3_POS) /**< LPWKPOL2A_3_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2A_4_POS                   8 /**< LPWKPOL2A_4 Position */
#define MXC_F_PWRSEQ_LPWKPOL2A_4                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2A_4_POS)) /**< LPWKPOL2A_4 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2A_4_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL2A_4_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_4_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL2A_4_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2A_4_POS) /**< LPWKPOL2A_4_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_4_RISING                ((uint32_t)0x1UL) /**< LPWKPOL2A_4_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_4_RISING                (MXC_V_PWRSEQ_LPWKPOL2A_4_RISING << MXC_F_PWRSEQ_LPWKPOL2A_4_POS) /**< LPWKPOL2A_4_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_4_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL2A_4_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_4_FALLING               (MXC_V_PWRSEQ_LPWKPOL2A_4_FALLING << MXC_F_PWRSEQ_LPWKPOL2A_4_POS) /**< LPWKPOL2A_4_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2A_5_POS                   10 /**< LPWKPOL2A_5 Position */
#define MXC_F_PWRSEQ_LPWKPOL2A_5                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2A_5_POS)) /**< LPWKPOL2A_5 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2A_5_BOTH_EDGES            ((uint32_t)0x0UL) /**< LPWKPOL2A_5_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_5_BOTH_EDGES            (MXC_V_PWRSEQ_LPWKPOL2A_5_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2A_5_POS) /**< LPWKPOL2A_5_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_5_RISING                ((uint32_t)0x1UL) /**< LPWKPOL2A_5_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_5_RISING                (MXC_V_PWRSEQ_LPWKPOL2A_5_RISING << MXC_F_PWRSEQ_LPWKPOL2A_5_POS) /**< LPWKPOL2A_5_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2A_5_FALLING               ((uint32_t)0x2UL) /**< LPWKPOL2A_5_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2A_5_FALLING               (MXC_V_PWRSEQ_LPWKPOL2A_5_FALLING << MXC_F_PWRSEQ_LPWKPOL2A_5_POS) /**< LPWKPOL2A_5_FALLING Setting */

