analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/pwrseq_regs.h
#define MXC_F_PWRSEQ_LPWKPOL2B_20_POS                  8 /**< LPWKPOL2B_20 Position */
#define MXC_F_PWRSEQ_LPWKPOL2B_20                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2B_20_POS)) /**< LPWKPOL2B_20 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2B_20_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2B_20_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_20_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2B_20_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2B_20_POS) /**< LPWKPOL2B_20_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_20_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2B_20_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_20_RISING               (MXC_V_PWRSEQ_LPWKPOL2B_20_RISING << MXC_F_PWRSEQ_LPWKPOL2B_20_POS) /**< LPWKPOL2B_20_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_20_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2B_20_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_20_FALLING              (MXC_V_PWRSEQ_LPWKPOL2B_20_FALLING << MXC_F_PWRSEQ_LPWKPOL2B_20_POS) /**< LPWKPOL2B_20_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2B_21_POS                  10 /**< LPWKPOL2B_21 Position */
#define MXC_F_PWRSEQ_LPWKPOL2B_21                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2B_21_POS)) /**< LPWKPOL2B_21 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2B_21_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2B_21_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_21_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2B_21_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2B_21_POS) /**< LPWKPOL2B_21_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_21_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2B_21_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_21_RISING               (MXC_V_PWRSEQ_LPWKPOL2B_21_RISING << MXC_F_PWRSEQ_LPWKPOL2B_21_POS) /**< LPWKPOL2B_21_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_21_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2B_21_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_21_FALLING              (MXC_V_PWRSEQ_LPWKPOL2B_21_FALLING << MXC_F_PWRSEQ_LPWKPOL2B_21_POS) /**< LPWKPOL2B_21_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2B_22_POS                  12 /**< LPWKPOL2B_22 Position */
#define MXC_F_PWRSEQ_LPWKPOL2B_22                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2B_22_POS)) /**< LPWKPOL2B_22 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2B_22_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2B_22_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_22_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2B_22_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2B_22_POS) /**< LPWKPOL2B_22_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_22_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2B_22_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_22_RISING               (MXC_V_PWRSEQ_LPWKPOL2B_22_RISING << MXC_F_PWRSEQ_LPWKPOL2B_22_POS) /**< LPWKPOL2B_22_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_22_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2B_22_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_22_FALLING              (MXC_V_PWRSEQ_LPWKPOL2B_22_FALLING << MXC_F_PWRSEQ_LPWKPOL2B_22_POS) /**< LPWKPOL2B_22_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2B_23_POS                  14 /**< LPWKPOL2B_23 Position */
#define MXC_F_PWRSEQ_LPWKPOL2B_23                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2B_23_POS)) /**< LPWKPOL2B_23 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2B_23_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2B_23_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_23_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2B_23_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2B_23_POS) /**< LPWKPOL2B_23_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_23_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2B_23_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_23_RISING               (MXC_V_PWRSEQ_LPWKPOL2B_23_RISING << MXC_F_PWRSEQ_LPWKPOL2B_23_POS) /**< LPWKPOL2B_23_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_23_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2B_23_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_23_FALLING              (MXC_V_PWRSEQ_LPWKPOL2B_23_FALLING << MXC_F_PWRSEQ_LPWKPOL2B_23_POS) /**< LPWKPOL2B_23_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2B_24_POS                  16 /**< LPWKPOL2B_24 Position */
#define MXC_F_PWRSEQ_LPWKPOL2B_24                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2B_24_POS)) /**< LPWKPOL2B_24 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2B_24_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2B_24_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_24_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2B_24_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2B_24_POS) /**< LPWKPOL2B_24_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_24_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2B_24_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_24_RISING               (MXC_V_PWRSEQ_LPWKPOL2B_24_RISING << MXC_F_PWRSEQ_LPWKPOL2B_24_POS) /**< LPWKPOL2B_24_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_24_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2B_24_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_24_FALLING              (MXC_V_PWRSEQ_LPWKPOL2B_24_FALLING << MXC_F_PWRSEQ_LPWKPOL2B_24_POS) /**< LPWKPOL2B_24_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2B_25_POS                  18 /**< LPWKPOL2B_25 Position */
#define MXC_F_PWRSEQ_LPWKPOL2B_25                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2B_25_POS)) /**< LPWKPOL2B_25 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2B_25_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2B_25_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_25_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2B_25_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2B_25_POS) /**< LPWKPOL2B_25_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_25_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2B_25_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_25_RISING               (MXC_V_PWRSEQ_LPWKPOL2B_25_RISING << MXC_F_PWRSEQ_LPWKPOL2B_25_POS) /**< LPWKPOL2B_25_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_25_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2B_25_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_25_FALLING              (MXC_V_PWRSEQ_LPWKPOL2B_25_FALLING << MXC_F_PWRSEQ_LPWKPOL2B_25_POS) /**< LPWKPOL2B_25_FALLING Setting */

#define MXC_F_PWRSEQ_LPWKPOL2B_26_POS                  20 /**< LPWKPOL2B_26 Position */
#define MXC_F_PWRSEQ_LPWKPOL2B_26                      ((uint32_t)(0x3UL << MXC_F_PWRSEQ_LPWKPOL2B_26_POS)) /**< LPWKPOL2B_26 Mask */
#define MXC_V_PWRSEQ_LPWKPOL2B_26_BOTH_EDGES           ((uint32_t)0x0UL) /**< LPWKPOL2B_26_BOTH_EDGES Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_26_BOTH_EDGES           (MXC_V_PWRSEQ_LPWKPOL2B_26_BOTH_EDGES << MXC_F_PWRSEQ_LPWKPOL2B_26_POS) /**< LPWKPOL2B_26_BOTH_EDGES Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_26_RISING               ((uint32_t)0x1UL) /**< LPWKPOL2B_26_RISING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_26_RISING               (MXC_V_PWRSEQ_LPWKPOL2B_26_RISING << MXC_F_PWRSEQ_LPWKPOL2B_26_POS) /**< LPWKPOL2B_26_RISING Setting */
#define MXC_V_PWRSEQ_LPWKPOL2B_26_FALLING              ((uint32_t)0x2UL) /**< LPWKPOL2B_26_FALLING Value */
#define MXC_S_PWRSEQ_LPWKPOL2B_26_FALLING              (MXC_V_PWRSEQ_LPWKPOL2B_26_FALLING << MXC_F_PWRSEQ_LPWKPOL2B_26_POS) /**< LPWKPOL2B_26_FALLING Setting */

